robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2FOC-V3/src/can_icubProto_parser.c

/*
 * Copyright (C) 2011 Department of Robotics Brain and Cognitive Sciences - Istituto Italiano di Tecnologia
 * Author: Valentina Gaggero
 * email:   valentina.gaggero@iit.it
 * website: www.robotcub.org
 * Permission is granted to copy, distribute, and/or modify this program
 * under the terms of the GNU General Public License, version 2 or any
 * later version published by the Free Software Foundation.
 *
 * A copy of the license can be found at
 * http://www.robotcub.org/icub/license/gpl.txt
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General
 * Public License for more details
 */

#include <p33FJ128MC802.h>
#include <libpic30.h>

#include "can_icubProto.h"
#include "can_icubProto_parser.h"
#include "can_icubProto_trasmitter.h"

#include "UserParms.h"
#include "Status.h"
#include "crc16.h"
#include "2FOC.h"
#include "ecan.h"
#include "qep.h"

typedef enum
{ 
    CURR = 0, VEL = 1, POS = 2, VEL_CURR = 3
} PIDtype;

typedef enum 
{ 
    LOCK = 0, UNLOCK = 1,             
    KP = 2, KI = 3, KD = 4, 
    LIMINTEGRAL = 5, LIMOUTPUT = 6,
    KFF = 7, 
    STICTION_UP = 8, STICTION_DOWN = 9 
} PIDparam;

typedef enum 
{
    GENERIC = 0x00,
    BEMF = 0x01,
    HALL = 0x02,
    ELECTR_VMAX = 0x03
} MotorParam;

volatile static float fIKp    = 0.0f;
volatile static float fIKi    = 0.0f;
volatile static float fIKff   = 0.0f;
volatile static float fIKbemf = 0.0f;

volatile static float fSKp    = 0.0f;
volatile static float fSKi    = 0.0f;
volatile static float fSKff   = 0.0f;

volatile static float fCKp    = 0.0f;
volatile static float fCKi    = 0.0f;
volatile static float fCKff   = 0.0f;

extern volatile BOOL IPIDready;
extern volatile BOOL SPIDready;
extern volatile BOOL CPIDready;

static int calcExp(float kp, float ki, float kff, float kbemf)
{
    float max = kp;
    if (ki    > max) max = ki;
    if (kff   > max) max = kff;
    if (kbemf > max) max = kbemf;
    
    int exponent = 0;
            
    for (exponent = 0; exponent < 16; ++exponent)
    {
        float power = (float)(1<<exponent);
        
        if (max < power) return exponent;
    }
    
    return 0;
}
        
typedef struct      // size is 4+60+4+4 = 72
{
    uint32_t        canadr;
    uint8_t         filler60deviceinfo[60];

    uint8_t         mode;
    uint8_t         dummy0;       
    uint16_t        dummy1;
    uint32_t        crc;
} s_deviceinfo_in_flash_t;

static s_deviceinfo_in_flash_t s_devinfo = {1, {0}, 0, 0, 0, 0};

#define LIMIT(v, L) if (v > (L)) v = (L); else if (v < -(L)) v = -(L);

volatile unsigned char gCanProtocolCompatible = 0;
static unsigned char canprotoparser_bid;

static int s_canIcubProtoParser_parse_pollingMsg(tCanData *rxpayload, unsigned char rxlen, tCanData *txpayload, unsigned char *txlen);
static int s_canIcubProtoParser_parse_periodicMsg(unsigned char permsg_type, tCanData *rxpayload, unsigned char rxlen, tCanData *txpayload, unsigned char *txlen);
static int s_canIcubProtoParser_parse_canLoaderMsg(tCanData *rxpayload, unsigned char rxlen, tCanData *txpayload, unsigned char *txlen);

//extern volatile unsigned char received_canloader_msg;

void CanIcubProtoParserInit(unsigned char bid)
{
    canprotoparser_bid = bid;
}
// Parse CAN messages complient wit icub can protocol

void CanIcubProtoParserParse(unsigned long rxid, unsigned char rxlen, tCanData *rxpayload)
{
    tCanData txpayload;

    // Command Syntax ok
    int command_ok = 0;
    unsigned char txlen = 0;
    
    unsigned char msg_class = CAN_ICUBPROTO_STDID_GETCLASS(rxid);

    switch (msg_class)
    {
    case ICUBCANPROTO_CLASS_POLLING_MOTORCONTROL:
        command_ok = s_canIcubProtoParser_parse_pollingMsg(rxpayload, rxlen, &txpayload, &txlen);
        break;

    case ICUBCANPROTO_CLASS_PERIODIC_MOTORCONTROL:
        command_ok = s_canIcubProtoParser_parse_periodicMsg(CAN_ICUBPROTO_STDID_RX_GETPERMSGTYPE(rxid), rxpayload, rxlen, &txpayload, &txlen);
        break;

    case ICUBCANPROTO_CLASS_BOOTLOADER:
        command_ok = s_canIcubProtoParser_parse_canLoaderMsg(rxpayload, rxlen, &txpayload, &txlen);
        break;
    }

    if (command_ok)
    {
        if (txlen > 0)
        {
            CanIcubProtoSendResponse(CAN_ICUBPROTO_STDID_MAKE_TX(msg_class, canprotoparser_bid, CAN_ICUBPROTO_STDID_RX_GETSOURCE(rxid)), txlen, &txpayload);
        }
    }
}

static int s_canIcubProtoParser_parse_pollingMsg(tCanData *rxpayload, unsigned char rxlen, tCanData *txpayload, unsigned char *txlen)
{
    unsigned char cmd = rxpayload->b[0];

    *txlen=0;

    if (cmd == ICUBCANPROTO_POL_MC_CMD__SET_CONTROL_MODE)
    {
        if (rxlen!=2) return 0;
        
        if (!gCanProtocolCompatible) return 0;

        RequestControlMode(rxpayload->b[1]);

        return 1;
    }

    if (cmd == ICUBCANPROTO_POL_MC_CMD__GET_CONTROL_MODE)
    {
        if (rxlen!=1) return 0;

        txpayload->b[0] = cmd;
        txpayload->b[1] = gControlMode;
        *txlen = 2;

        return 1;
    }

    if (cmd == ICUBCANPROTO_POL_MC_CMD__GET_BOARD_ID)
    {
        if (rxlen!=1) return 0;
        
        txpayload->b[0] = cmd;
        txpayload->b[1] = canprotoparser_bid;
        *txlen=2;

        return 1;
    }

    if (cmd == ICUBCANPROTO_POL_MC_CMD__SET_BOARD_ID)
    {
        if (rxlen!=2) return 0;
        
        if (gControlMode != icubCanProto_controlmode_idle
         && gControlMode != icubCanProto_controlmode_notConfigured) return 0;
        
        canprotoparser_bid = rxpayload->b[1];
        //ApplicationData.EepromHeader.EE_CAN_BoardAddress = canprotoparser_bid;
        CanIcubProtoTransmitterUpdateBoardId(canprotoparser_bid);
        CanIcubProtoSetFilters(canprotoparser_bid);

        _memcpy_p2d16(&s_devinfo, 0x15000, sizeof(s_deviceinfo_in_flash_t));

        _erase_flash(0x15000);

        s_devinfo.canadr = canprotoparser_bid;

        s_devinfo.mode   = 1;
        s_devinfo.dummy0 = 0;
        s_devinfo.dummy1 = 0xcaac;
        s_devinfo.crc    = crc16(0xFFFF, (const unsigned char*)&s_devinfo, 64);
                  
        int i;
        for (i=0; i<sizeof(s_deviceinfo_in_flash_t); i+=_FLASH_ROW)
        {
            _write_flash16(0x15000+i, ((int*)(&s_devinfo))+i/2);
        }

        return 1;
    }

    if (cmd == ICUBCANPROTO_POL_MC_CMD__SET_CURRENT_LIMIT)
    {
        if (!gCanProtocolCompatible) return 0;
        
        if (rxlen==5)
        {
            int peak  = ((int)rxpayload->b[1])|(((int)rxpayload->b[2])<<8);

            setMaxCurrent(peak/2, peak, 20000);
            
            return 1;
        }
        else if (rxlen==8)
        {
            int nom  = ((int)rxpayload->b[2])|(((int)rxpayload->b[3])<<8);
            int peak = ((int)rxpayload->b[4])|(((int)rxpayload->b[5])<<8);
            int ovr  = ((int)rxpayload->b[6])|(((int)rxpayload->b[7])<<8);
            
            setMaxCurrent(nom, peak, ovr);

            return 1;
        }
    
        return 0;
    }

    if (cmd == ICUBCANPROTO_POL_MC_CMD__SET_TEMPERATURE_LIMIT)
    {
       if (!gCanProtocolCompatible) return 0;
        
        if (rxlen==3)
        {
            int peak  = ((int)rxpayload->b[1])|(((int)rxpayload->b[2])<<8);

            setMaxTemperature(peak);
            
            return 1;
        }
        
        return 0;
    }
    
    if (cmd == ICUBCANPROTO_POL_MC_CMD__SET_MOTOR_CONFIG)
    {
        if (rxlen < 7) return 0;
        
        if (!gCanProtocolCompatible) return 0;

        MotorConfig.bitmask = rxpayload->b[1];

        gEncoderConfig.resolution = rxpayload->w[1];
        gEncoderConfig.offset     = rxpayload->w[2];
        gEncoderConfig.numPoles   = rxpayload->b[6]/2;

        if (gEncoderConfig.offset == -1)
        {
            MotorConfig.fullcalib = TRUE;
            gEncoderConfig.full_calibration = TRUE;
            //gEncoderConfig.offset = 0;
        }
        else
        {
            MotorConfig.fullcalib = FALSE;
            gEncoderConfig.full_calibration = FALSE;
        }
        
        gEncoderConfig.tolerance = (rxlen == 8) ? rxpayload->b[7] : 36;
        
        if (MotorConfig.has_qe) MotorConfig.has_speed_qe = FALSE;
        
        return 1;
    }

    if (cmd == ICUBCANPROTO_POL_MC_CMD__GET_FIRMWARE_VERSION)
    {
        if (rxlen != 3) return 0;

        uint8_t server_can_protocol_major = rxpayload->b[1];
        uint8_t server_can_protocol_minor = rxpayload->b[2];

        gCanProtocolCompatible = CAN_PROTOCOL_VERSION_MAJOR == server_can_protocol_major 
                              && CAN_PROTOCOL_VERSION_MINOR == server_can_protocol_minor;

        *txlen = 8;
        txpayload->b[0] = ICUBCANPROTO_POL_MC_CMD__GET_FIRMWARE_VERSION;
        txpayload->b[1] = icubCanProto_boardType__2foc;
        txpayload->b[2] = FW_VERSION_MAJOR;
        txpayload->b[3] = FW_VERSION_MINOR;
        txpayload->b[4] = FW_VERSION_BUILD;
        txpayload->b[5] = CAN_PROTOCOL_VERSION_MAJOR;
        txpayload->b[6] = CAN_PROTOCOL_VERSION_MINOR;
        txpayload->b[7] = gCanProtocolCompatible; // can_protocol_ack;

        if (!gCanProtocolCompatible)
        {
            //SysError.CANInvalidProtocol = 1;
            //FaultConditionsHandler();
        }

        return 1;
    }

    if (cmd == ICUBCANPROTO_POL_MC_CMD__SET_CURRENT_PID)
    {
        extern volatile int  IKp;
        extern volatile int  IKi;
        extern volatile int  IKff;
        extern volatile int  IKbemf;
        extern volatile char IKs;
        
        if (!gCanProtocolCompatible) return 0;
       
        if (rxlen==8)
        {
            int  kp    = ((int)rxpayload->b[1])|(((int)rxpayload->b[2])<<8);
            int  ki    = ((int)rxpayload->b[3])|(((int)rxpayload->b[4])<<8);
            char ks    = rxpayload->b[7];
            
            fIKp = ((float)kp)/((float)(1L<<ks)); 
            fIKi = ((float)ki)/((float)(1L<<ks));
                        
            int exponent = calcExp(fIKp,fIKi,fIKff,fIKbemf);
            float Knorm = (float)(1L<<(15-exponent));
            
                kp    = (int)(fIKp   *Knorm);
                ki    = (int)(fIKi   *Knorm);
            int kff   = (int)(fIKff  *Knorm);
            int kbemf = (int)(fIKbemf*Knorm);
                    
            setIPid(kp,ki,kff,kbemf,15-exponent);
            
            IPIDready = TRUE;

            tCanData payload;
            payload.w[0] = IKp;
            payload.w[1] = IKi*2;
            payload.w[2] = IKff;
            payload.w[3] = 1;
            CanSendDebug(&payload, 8);
            
            return 1;
        }

        return 0;
    }

    if (cmd == ICUBCANPROTO_POL_MC_CMD__SET_VELOCITY_PID)
    {
        extern volatile int  SKp;
        extern volatile int  SKi;
        extern volatile int  SKff;
        extern volatile char SKs;
        
        if (!gCanProtocolCompatible) return 0;
       
        if (rxlen==8)
        {
            int  kp  = ((int)rxpayload->b[1])|(((int)rxpayload->b[2])<<8);
            int  ki  = ((int)rxpayload->b[3])|(((int)rxpayload->b[4])<<8);
            char ks  = rxpayload->b[7];
            
            fSKp = ((float)kp)/((float)(1L<<ks)); 
            fSKi = ((float)ki)/((float)(1L<<ks));
            
            int exponent = calcExp(fSKp,fSKi,fSKff,0);
            float Knorm = (float)(1L<<(15-exponent));
            
                kp    = (int)(fSKp   *Knorm);
                ki    = (int)(fSKi   *Knorm);
            int kff   = (int)(fSKff  *Knorm);
 
            setSPid(kp,ki,kff,15-exponent);
            
            SPIDready = TRUE;

            tCanData payload;
            payload.w[0] = SKp;
            payload.w[1] = SKi*2;
            payload.w[2] = SKff;
            payload.w[3] = 2;
            CanSendDebug(&payload, 8);
            
            return 1;
        }
        
        return 0;
    }
    
    if (cmd == ICUBCANPROTO_POL_MC_CMD__SET_PID)
    {
        if (rxlen!=8) return 0;
        
        float fk;
        memcpy(&fk,&(rxpayload->b[4]),4);
        
        PIDtype  pid_type  = rxpayload->b[1];
        PIDparam pid_param = rxpayload->b[2];
        
        if (pid_type == CURR)
        {            
            static BOOL locked = FALSE;
            
            switch (pid_param)
            {
                case KP:     fIKp    = fk;  break;
                case KI:     fIKi    = fk;  break;
                case KFF:    fIKff   = fk;  break;
                case LOCK:   locked = TRUE; break;
                default: break;
            }
            
            if (!locked || pid_param==UNLOCK)
            {
                locked = FALSE;
                
                int exponent = calcExp(fIKp,fIKi,fIKff,fIKbemf);
                float Knorm = (float)(1L<<(15-exponent));
            
                int kp    = (int)(fIKp   *Knorm);
                int ki    = (int)(fIKi   *Knorm);
                int kff   = (int)(fIKff  *Knorm);
                int kbemf = (int)(fIKbemf*Knorm);
                    
                setIPid(kp,ki,kff,kbemf,15-exponent);
                    
                IPIDready = TRUE;
            }
        
            return 1;
        }
        else if (pid_type == VEL)
        {
            static BOOL locked = FALSE;
            
            switch (pid_param)
            {
                case KP:     fSKp  = fk; break;
                case KI:     fSKi  = fk; break;
                case KFF:    fSKff = fk; break;
                case LOCK:   locked = TRUE; break;
                default: break;
            }
            
            if (!locked || pid_param==UNLOCK)
            {
                locked = FALSE;
                
                int exponent = calcExp(fSKp,fSKi,fSKff,0);
                float Knorm = (float)(1L<<(15-exponent));
            
                int kp    = (int)(fSKp   *Knorm);
                int ki    = (int)(fSKi   *Knorm);
                int kff   = (int)(fSKff  *Knorm);
                
                setSPid(kp,ki,kff,15-exponent);
                    
                SPIDready = TRUE;
            }
        
            return 1;
        }
        else if (pid_type == VEL_CURR)
        {
            static BOOL locked = FALSE;
            
            switch (pid_param)
            {
                case KP:     fCKp  = fk; break;
                case KI:     fCKi  = fk; break;
                case KFF:    fCKff = fk; break;
                case LOCK:   locked = TRUE; break;
                default: break;
            }
            
            if (!locked || pid_param==UNLOCK)
            {
                locked = FALSE;
                
                int exponent = calcExp(fCKp,fCKi,fCKff,0);
                float Knorm = (float)(1L<<(15-exponent));
            
                int kp    = (int)(fCKp   *Knorm);
                int ki    = (int)(fCKi   *Knorm);
                int kff   = (int)(fCKff  *Knorm);
                
                setCPid(kp,ki,kff,15-exponent);
                    
                CPIDready = TRUE;
                
                extern volatile int  CKp;
                extern volatile int  CKi;
                extern volatile int  CKff;
                extern volatile char CKs;
                
                tCanData payload;
                payload.w[0] = CKp;
                payload.w[1] = CKi*2;
                payload.w[2] = CKff;
                payload.w[3] = 3;
                CanSendDebug(&payload, 8);
            }
        
            return 1;
        }
                
        return 0;
    }
    
    if (cmd == ICUBCANPROTO_POL_MC_CMD__SET_MOTOR_PARAM)
    {
        if (rxlen!=8) return 0;
        
        float fk;
        memcpy(&fk,&(rxpayload->b[2]),4);
        
        MotorParam param_type = rxpayload->b[1];
        
        if (param_type == BEMF)
        {
            fIKbemf = fk;
            
            int exponent = calcExp(fIKp,fIKi,fIKff,fIKbemf);
            float Knorm = (float)(1L<<(15-exponent));
            
            int kp    = (int)(fIKp   *Knorm);
            int ki    = (int)(fIKi   *Knorm);
            int kff   = (int)(fIKff  *Knorm);
            int kbemf = (int)(fIKbemf*Knorm);
                    
            setIPid(kp,ki,kff,kbemf,15-exponent);
                                
            return 1;
        }

        return 0;
    }

    if (cmd == ICUBCANPROTO_POL_MC_CMD__SET_DESIRED_VELOCITY)
    {
        if (rxlen!=5) return 0;
        
        if (!gCanProtocolCompatible) return 0;

        // acceleration is unused

        if (gControlMode == icubCanProto_controlmode_speed_voltage
         || gControlMode == icubCanProto_controlmode_speed_current)
        {
            CtrlReferences.WRef = (rxpayload->b[2] << 8 | rxpayload->b[1]);
            LIMIT(CtrlReferences.WRef, UDEF_SPEED_MAX)

            return 1;
        }

        return 0;
    }

    if (cmd == ICUBCANPROTO_POL_MC_CMD__SET_OPENLOOP_PARAMS)
    {
        if (rxlen!=3) return 0;
        
        if (!gCanProtocolCompatible) return 0;

        if (gControlMode != icubCanProto_controlmode_openloop) return 0;

        CtrlReferences.VqRef = (rxpayload->b[2] << 8 | rxpayload->b[1]);
        LIMIT(CtrlReferences.VqRef, UDEF_PWM_MAX)

        return 1;
    }

    if (cmd == ICUBCANPROTO_POL_MC_CMD__SET_DESIRED_CURRENT)
    {
        if (rxlen!=5) return 0;

        if (!gCanProtocolCompatible) return 0;
        
        if (gControlMode != icubCanProto_controlmode_current) return 0;

        CtrlReferences.IqRef = (rxpayload->b[2] << 8 | rxpayload->b[1]);
        LIMIT(CtrlReferences.IqRef, Ipeak)

        return 1;
    }

    if (cmd == ICUBCANPROTO_POL_MC_CMD__GET_DESIRED_CURRENT)
    {
        if (rxlen!=1) return 0;

        *txlen = 5;
        txpayload->b[0] = cmd;
        memcpy(&txpayload->b[1], (void*)&(CtrlReferences.IqRef), 2);
        txpayload->b[3] = txpayload->b[4] = 0;

        return 1;
    }

    /*
    if (cmd == ICUBCANPROTO_POL_MC_CMD__SET_PERIODIC_MSG_CONTENTS)
    {
        if (rxlen!=5) return 0;

        // check data to transmit if in the acceptable range
        if ((rxpayload->b[1] < ELEMENTS_IN_PERIODIC_DATA_LIST)
         && (rxpayload->b[2] < ELEMENTS_IN_PERIODIC_DATA_LIST)
         && (rxpayload->b[3] < ELEMENTS_IN_PERIODIC_DATA_LIST)
         && (rxpayload->b[4] < ELEMENTS_IN_PERIODIC_DATA_LIST))
        {
            // set the data to transmit
            PeriodicMessageContents[0] = rxpayload->b[1];
            PeriodicMessageContents[1] = rxpayload->b[2];
            PeriodicMessageContents[2] = rxpayload->b[3];
            PeriodicMessageContents[3] = rxpayload->b[4];

            // precalculate this here. This is an optimization
            gulpadr1 = (unsigned int*) PeriodicData[PeriodicMessageContents[0]];
            gulpadr2 = (unsigned int*) PeriodicData[PeriodicMessageContents[1]];
            gulpadr3 = (unsigned int*) PeriodicData[PeriodicMessageContents[2]];
            gulpadr4 = (unsigned int*) PeriodicData[PeriodicMessageContents[3]];

            return 1;
        }
        return 0;
    }
    */

    if (cmd == ICUBCANPROTO_POL_MC_CMD__SET_I2T_PARAMS)
    {
        if (rxlen!=5) return 0;
  
        //I2Tdata.Param = (rxpayload->b[2] << 8 | rxpayload->b[1]);
        //I2Tdata.IThreshold = (rxpayload->b[4] << 8 | rxpayload->b[3]);

        return 1;
    }

    return 0;
}

static int s_canIcubProtoParser_parse_periodicMsg(unsigned char permsg_type, tCanData *rxpayload, unsigned char rxlen, tCanData *txpayload, unsigned char *txlen)
{
    *txlen=0;

    if (permsg_type == ICUBCANPROTO_PER_MC_MSG__EMSTO2FOC_DESIRED_CURRENT)
    {
        SETPOINT_WATCHDOG_REARM()

        if ((canprotoparser_bid<<1) > rxlen) return 0;

        int ref = rxpayload->w[canprotoparser_bid-1];

        switch (gControlMode)
        {
        case icubCanProto_controlmode_velocity:
        case icubCanProto_controlmode_speed_voltage:
        case icubCanProto_controlmode_speed_current:
            LIMIT(ref, UDEF_SPEED_MAX)
            CtrlReferences.WRef  = ref;
            break;

        case icubCanProto_controlmode_current:
            LIMIT(ref, Ipeak)
            CtrlReferences.IqRef = ref;
            //CtrlReferences.VqRef = CtrlReferences.WRef = 0;
            break;

        case icubCanProto_controlmode_openloop:
            LIMIT(ref, UDEF_PWM_MAX)
            CtrlReferences.VqRef = ref;
            //CtrlReferences.IqRef = CtrlReferences.WRef = 0;
            break;

        case icubCanProto_controlmode_idle:
            ZeroControlReferences();
            break;
        }

        CanIcubProtoTrasmitterSendPeriodicData();
        
        return 1;
    }

    return 0;
}

static int s_canIcubProtoParser_parse_canLoaderMsg(tCanData *rxpayload, unsigned char rxlen, tCanData *txpayload, unsigned char *txlen)
{
    unsigned char cmd = rxpayload->b[0];
    
    *txlen=0;

    if (cmd == ICUBCANPROTO_BL_BROADCAST)
    {
        if (rxlen!=1) return 0;
       
        *txlen=5;
        txpayload->b[0] = cmd;
        txpayload->b[1] = icubCanProto_boardType__2foc;
        txpayload->b[2] = FW_VERSION_MAJOR;
        txpayload->b[3] = FW_VERSION_MINOR;
        txpayload->b[4] = FW_VERSION_BUILD;

        return 1;
    }

    if (cmd == ICUBCANPROTO_BL_BOARD)
    {
        asm ("reset"); // Jump to bootloader code
        return 1;
    }

    if (cmd == ICUBCANPROTO_BL_GET_ADDITIONAL_INFO) return 1;
    if (cmd == ICUBCANPROTO_BL_SET_ADDITIONAL_INFO) return 1;

    return 0;
}
